{
  "id": "sample-life-skills-workshops",
  "type": "blog",
  "title": "Life Skills Workshops at Alpha School: Creating Future-Ready Students",
  "date": "April 1st, 2025",
  "authorName": "Kelly Davis",
  "authorRole": "Global Strategy Lead for Education Marketing",
  "authorBio": "Kelly Davis is an education strategist with 16 years of teaching experience and a passion for reimagining how students learn. With extensive background in alternative education models, she now leads strategy in education marketing globally—connecting innovative AI learning solutions with the families and students who need them most.",
  "summary": "Alpha School's Life Skills Workshops equip students with essential skills for personal growth, adaptability, and future success. Through engaging activities and targeted programs, students develop confidence, resilience, and practical abilities that prepare them for real-world challenges.",
  "image": "/assets/blog-images/blog-image-1.webp",
  "content": "<div class=\"space-y-[var(--space-md)]\">\n  <p>\"When will I ever use this?\" That refrain has been uttered by students for decades. And to an extent, they have a point. Traditionally, students learn so much but not financial literacy. They're trained English language arts, but rarely do they find the finer points of negotiation and debate.\nBut skills like those mentioned above—plus others such as grit, sociability, teamwork, critical thinking, problem-solving, and confidence—are invaluable for navigating both personal and professional life. In most schools, students are expected to cultivate them for an hour or so in afterschool activities. But with the 2 Hour Learning model core of academics at our flagship school, Alpha School, there's a full four hours in the afternoon for sessions that build essential life skills.\nLet's take a look at four examples of these life skills workshops.</p>\n\n  <h2 class=\"heading-style-h4\">1. The \"Better Together\" Workshop</h2>\n  <p>Designed for students in kindergarten and first grade, this life skills workshop teaches participants how to play games fairly, how not to give up or cry when they're losing, and to cheer on their classmates. Those children begin to acquire essential life skills, such as getting along with others, grit, and self-confidence, and self-directed learning.</p>\n\n  <h2 class=\"heading-style-h4\">2. The Triathlon Student Workshop</h2>\n  <p>Students in second through fourth grade take part in a triathlon that requires them to solve a Rubik's Cube, juggle bean items for 30 seconds, and run half a mile. It may sound a little weird, but it's all about developing grit and a growth mindset.\nA lot of the kids initially believe that there's no way for them to accomplish one or more of those tasks. But over the course of six weeks, we help them figure out the strategies that will help them solve the Rubik's Cube. They also find that when they run at the end, they build their endurance and speed.\nAt the end of the workshop, students go through a \"Test to Pass,\" where they demonstrate their new abilities. The test confirms that they've been able to stick with something that's hard and keep going when they're frustrated—essential life skills that will serve them well in any field.</p>\n\n  <h2 class=\"heading-style-h4\">3. The \"HypeSquad\" Workshop</h2>\n  <p>One of Alpha's most fun and engaging life skills workshops for fifth and sixth graders is the HypeSquad. Teamwork is taught through team chants, but it's this: each student is assigned a classmate as their \"hype man.\" The hype man is expected to note down accomplishments and great qualities in the student at a moment's notice. By the end, every child has discovered, and communicated, the strengths and skills of their classmates and themselves.\nThe sense of belonging is unparalleled.\nThe HypeSquad is one of the student workshops that focuses on building up uplifting and positive school culture among Alpha students. The children leave energized, inspired, and ready to cheer on others. Alpha's approach to life skills is about helping students build the confidence to try new things, to cheer each other on, and to learn how to better way to engage with each other and with any learning challenge that comes their way.</p>\n\n  <h2 class=\"heading-style-h4\">4. High School Social Scene Prep Workshop</h2>\n  <p>Middle schoolers often say that the thing that scares them most about high school is the social scene. In one of Alpha's life skills workshops, students at the middle school level learn how to crush the social scene in healthy and positive ways.\nThe student workshop is divided into three stages. In the first stage, students practice navigating friendships, handling social pressure, and building strong, positive relationships with their classmates. In the second stage, the kids head over to the friendly Alpha high school tutor table to practice real social skills. Stage three happens in the partner school's high school cafeteria. By the end of this workshop, kids are as confident in their social capabilities as they are in their academics.</p>\n\n  <h2 class=\"heading-style-h4\">Life Skills Workshops Increase Students' Confidence and Adaptability</h2>\n  <p>These are just a few examples of the workshops that Alpha students attend. There are dozens more workshops at every grade level, ranging from math elites to financial literacy, entrepreneurship, public speaking and communication, community engagement, and personal success. (Really, that communication workshop may spark students' interest and replaces the less engaging workshops with fresh options.)\nParticipating in these workshops gives Alpha's students skills they carry forward into college and careers:</p>\n  <ul>\n    <li>Overcoming physical and academic challenges teaches them resilience.</li>\n    <li>Starting businesses or leading team projects fosters their initiative.</li>\n    <li>Early exposure to financial literacy helps students make smart financial choices in the future.</li>\n    <li>Public speaking and communication skills gives students the confidence to participate in group work, lead discussions, and conduct presentations.</li>\n    <li>Learning how to cheer for others, handle setbacks, and support teammates sets students up for current and life success.</li>\n  </ul>\n\n  <h2 class=\"heading-style-h4\">Giving Students a Solid Foundation for the Future</h2>\n  <p>Alpha School proves that learning can be faster, smarter, and more meaningful. By the time students graduate from Alpha, they don't just believe they are limitless; they have the skills to prove it.</p>\n</div>",
  "slug": "life-skills-workshops-alpha-school"
} 